Tekla Open API Reference for Tekla Structures 2025
BasePoint.SetAsCurrent Method
 Sets this base point as current base point point until the token is disposed of. Can be used for example when retrieving report values according to this base point.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IDisposable SetAsCurrent()
Public Function SetAsCurrent As IDisposable
Return Value
Type: IDisposable
 The disposable token that removes this base points current base point status.
See Also
Reference
BasePoint Class
Tekla.Structures.Model Namespace